//
//  MockTranscript.swift
//  Retrospective-Rulersalmon
//
//  Created by dlsundn on 5/27/26.
//

import Foundation

enum MockTranscript {
    //
    //  MockTranscript.swift
    //  Retrospective-Rulersalmon
    //
        static let questionAnswerSample = """
        아침에 조금 늦게 일어나서 지각을 했습니다. 조금만 일찍 일어나면 지각을 안 할 수 있는 거 아침에 일어나기가 너무 힘들고 준비를 느긋하게 하는 바람에 제일 아슬아슬한 버스를 타서 치각을 했구요. 오늘은 이제 챌린지 리스폰스 바일스톤을 멘토에게 전달해주는 멘토 분들에게 발표하는 시간을 가졌는데 두 분들께 좀 저희 트렌지 리스폰투스가 뾰족하지 못하다 라는 피트백을 받았습니다. 제가 생각했을 때도 저희 틀집 리스톤스를 명확히 이해하지 못했고 좀 더 다양한 외교의 방식 중이에 어떤 방식을 택할 건지 생각해보면 좋겠다 라는 생각을 했고 또 오늘은 도라에 지혜가 있었어요. 피처리스트랑 테스크플로우를 작성하는 방법인데 먼저 이제 테스크 플로우 작성하는 방식은 시작 전과 급점을 먼저 정하면 된다고 했어요. 앱의 시작 전과 끝점을 정하고 이 시작해서 끝까지 가기 위한 과정들을 상무용차 경험으로 작성한 후에 그리고 결과 그 과정을 가기 위한 기능들을 이렇게 적는 거였습니다. 좀 돌아가 정말 자세히 설명해주시고 저도 노션에 잘 정리를 해놨기 때문에 피처리스트 작성할 때 많이 전공하면 좋을 것 같구요. 그리고 이제 직후에 아이OS 아 뭐였더라 바이오스가 아니라 디자인 패턴인 애플이였던 것 같아요. 그래서 우리 앱이 어떤 OS에서 가장 적합할지 각 OS들을 줘서 하고 어느 부분이 우리에게 좋을지 제 생각하는 지혜였구요. 그때 잼이랑 같이 했는데 저희는 이제 미로포드에서 저희 팀의 미로포드를 작성하는 게 아니라 그냥 랜덤으로 작성해야 되는 줄 알고 팀팅 신팅이로 적었다가 아이자기 팀팅 신팅 다른 팀 위로 보대 작성해달라고 지자를 받았습니다. 아이자기 입에서 신팅 잼팅이 나올 줄 정말 몰랐고요. 그리고 난 뭐였지 이제 끝나고 이원자끼리 이 모여서 얘기를 좀 해봤습니다. 아 피처리스트를 작성하기 위해서 저희가 좀 더 챌린지 리스폰서를 다듬아야 되겠다고 생각을 해서. 밥을 먹고 회의를 하기로 했어요. 저는 점심을 샐러드로 먹었고 다음에 저녁은 아 점심 시라때로 먹고 팀끼리 2시부터 5시 반까지 회의를 진행했습니다. 근데 이제 저희가 좀 계속 계속 같은 일 좀 회의를 진행하면서 다 토의를 해보면서 결국엔 전화를 하는 방향성으로 갖게 되었는데 지금 내가 이렇게 음성 녹음으로 회고를 하는 것도 지금 저희 앱의 기능을 좀 실험하기 위해서 계속 녹음을 하는 것도 있고 실제로 지금 너무 피곤해서 사에 앉을 힘이 없어 앉을 힘이 없어서 이렇게 음성 녹음으로라도 회고를 진행해야겠다라는 생각이 들어서 녹음을 켰습니다. 배드민턴을 갔다 왔다가 집에서 씻고 밥 먹고 과제 하니까 벌써 이 시간이다 좀 더 휴대폰 하는 시간을 줄이고 나의 시간을 효율적으로 사용해야 되는데 그래도 어제보다 더 나은 오늘이 되었고 아직 피처리스 테스크플로를 다 작성하지 못했는데 오늘 아침에 6시에서 6시 반쯤 일어나서 스플러워를 좀 완성하는 게 목표입니다. 저는 좀 스핏과 비슷한 방향으로 가면 좋겠어서 스픽 유아이를 많이 참고해야 될 것 같고요. 그리고 오늘 좀 이건 개인적으로 회고를 넘기는 건데 학교 과제를 할 때 AI한테 과제를 맡겼는데 정말 게 정교하게 잘 만들어줬다. 과제 조건들을 그냥 피 제가 명시하지 않고 PDF만 줘서 이 과제 조건들을 참고해서 내 파일들을 고쳐 달라 알아서 고쳐주더라고요. 근데 과연 이렇게 AI 성능들이 점점 더 좋아지고 내가 취업을 할 수 있을까? 라는 생각이 너무 들고 나는 지금 백앤데 기술도 명확히 알지도 못하고 뭔가 내 머릿속에 이런 지식들이 정리되어 있지도 않고 시스 식이라던가 어떤 데이터 베이스 구축하던던지 파이프라임 구축하던 던지 이런 전문 용어들도 잘 이해를 못하는 상황에서 나는 과연 개발자라고 할 수 있을까? 그래서 iOS 개발도 엄청 뛰어난 것도 아니야 난 도대체 어디 어느 회사에서 일을 할 수 있을지 가 너무너무 고민이 됩니다. 그래서 저는 지금 현재 목표는 신한투자증권에 대학생 인턴을 뽑더라고요. 그거를 한번 지원을 해볼 예정입니다. 과연 내가 지금 이 현 시점에서 나의 스펙으로 이 인턴을 합격할 수 있을까? 라는 고민도 되고 좀 더 멘토 분들과 대화를 많이 나누고 좀 점심을 먹는 시간을 가져야겠다 좀 목요일은 이주로 목요일은 좀 멘토분들 과 같이 상담하는 시간을 가져보는 게 어떨지 아예 혼자서 개인적인 생각이고 좀 개인 프로젝트를 할 시간이 필요하다. 그래도 라인트 식스는 팀 프로젝트를 하지만 지금 상황으로 봤을 땐 거의 하루 종일 팀 프로젝트의 시간을 쏟아야 될 것 같은 데 지금 이 상황에서는 팀 프로젝트에만 챌린 디자인 팀 프로젝트에만 집중을 하는 게 맞는지 아니면 나의 개인 프로젝트도 좀 더 고민을 해봐야 될지 그저 고민이 되고 또 멘토분들과 상담을 했을 때 어떤 질문들을 하면 좋을지 추천을 해줬으면 좋겠다 오늘의 회복 끝 이게 내 전사문인데 아주 정확하진 않지만 맥락을 보고 네가 정리해주면 좋겠어
        """
    }

